samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
#define JAVASCRIPT_HEADER                                                     \
    "<script type='text/javascript' language='JavaScript'><!--\n"
#define JAVASCRIPT_FOOTER                                                     \
    "//--></script>\n"

//*****************************************************************************
//
// Timeout for DHCP address request (in seconds).
//
//*****************************************************************************
#ifndef DHCP_EXPIRE_TIMER_SECS
#define DHCP_EXPIRE_TIMER_SECS  45
#endif

//*****************************************************************************
//
// The current IP address.
//
//*****************************************************************************
uint32_t g_ui32IPAddress;

//*****************************************************************************
//
// MQTT IO integration state: a periodic tick flag set by SysTick, and a
// request flag asking the main loop to (re)start the MQTT connection (set
// when an IP is acquired or the configuration changes via the web UI).
//
//*****************************************************************************
static volatile bool g_bSysTickFlag;
static volatile bool g_bStartMQTT;
static volatile bool g_bRepublishMQTT;
static volatile bool g_bOTAReset;       // set by FwChunkCGIHandler on last chunk

//
// OTA upload state — written from the CGI handler (Ethernet ISR context).
//
static uint32_t g_ui32OTAWriteAddr;
static uint32_t g_ui32OTASize;
static uint8_t  g_ui8OTAAlignBuf[4];
static uint32_t g_ui32OTAAlignLen;
static uint32_t g_ui32OTALastErasedPage;

//*****************************************************************************
//
// The system clock frequency.  Used by the SD card driver.
//
//*****************************************************************************
uint32_t g_ui32SysClock;

//*****************************************************************************
//
// The error routine that is called if the driver library encounters an error.
//
//*****************************************************************************
#ifdef DEBUG
void
__error__(char *pcFilename, uint32_t ui32Line)
{
}
#endif

//*****************************************************************************
//
// Helper: copy a (possibly URL-encoded) CGI parameter into a fixed buffer.
//
//*****************************************************************************
static void
GetStringParam(const char *pcName, char *pcParam[], char *pcValue[],
               int32_t i32NumParams, char *pcDest, int32_t i32DestLen)
{
    int32_t i32Idx = FindCGIParameter(pcName, pcParam, i32NumParams);
    if(i32Idx != -1)
    {
        DecodeFormString(pcValue[i32Idx], pcDest, i32DestLen);
    }
}

//*****************************************************************************
//
// CGI handler for /mqttcfg.cgi.  Parses the configuration form, stores the
// new settings in EEPROM and requests a reconnect.
//
//*****************************************************************************
static char *
MQTTConfigCGIHandler(int32_t iIndex, int32_t i32NumParams, char *pcParam[],
                     char *pcValue[])
{
    tMQTTConfig *psCfg = ConfigGet();
    int32_t i32Idx;

    (void)iIndex;

    //
    // String fields.  Empty values are accepted (e.g. to clear the host).
    //
    psCfg->pcHost[0] = '\0';
    GetStringParam("host", pcParam, pcValue, i32NumParams, psCfg->pcHost,
                   CFG_HOST_LEN);
    GetStringParam("client", pcParam, pcValue, i32NumParams, psCfg->pcClientID,
                   CFG_CLIENTID_LEN);
    GetStringParam("user", pcParam, pcValue, i32NumParams, psCfg->pcUser,
                   CFG_USER_LEN);
    GetStringParam("topic", pcParam, pcValue, i32NumParams, psCfg->pcTopicBase,
                   CFG_TOPIC_LEN);

    //
    // Password: only overwrite the stored value when a non-empty value is
    // submitted (the form never echoes the current password back).
    //
    i32Idx = FindCGIParameter("pass", pcParam, i32NumParams);
    if((i32Idx != -1) && (pcValue[i32Idx][0] != '\0'))
    {
        DecodeFormString(pcValue[i32Idx], psCfg->pcPass, CFG_PASS_LEN);
    }

    //
    // Port number.
    //
    i32Idx = FindCGIParameter("port", pcParam, i32NumParams);
    if(i32Idx != -1)
    {
        uint32_t ui32Port = ustrtoul(pcValue[i32Idx], 0, 10);
        psCfg->ui16Port = (ui32Port && (ui32Port <= 65535)) ?
                          (uint16_t)ui32Port : 1883;
    }

    //
    // Authentication checkbox (present in the form only when ticked).
    //
    psCfg->ui8UseAuth =
        (FindCGIParameter("auth", pcParam, i32NumParams) != -1) ? 1 : 0;

    //
    // Persist and ask the main loop to apply the new settings.
    //
    ConfigSave();
    g_bStartMQTT = true;

    return(DEFAULT_CGI_RESPONSE);
}

//*****************************************************************************
//
// Convert one ASCII hex character to its 4-bit value.
//
//*****************************************************************************
static uint8_t
HexNibble(char c)
{
    if((c >= '0') && (c <= '9'))
    {
        return((uint8_t)(c - '0'));
    }
    if((c >= 'a') && (c <= 'f'))
    {
        return((uint8_t)(c - 'a' + 10));
    }
    if((c >= 'A') && (c <= 'F'))
    {
        return((uint8_t)(c - 'A' + 10));
    }
    return(0);
}

//*****************************************************************************
//
// CGI handler for /iocfg.cgi.  Parses device counts and per-input type
// bitmask from the I/O configuration form, persists them to EEPROM and
// triggers a re-publish of HA discovery topics.
//
//*****************************************************************************
static char *
IOConfigCGIHandler(int32_t iIndex, int32_t i32NumParams, char *pcParam[],
                   char *pcValue[])
{
    int32_t i32Idx;

    (void)iIndex;

    //
    // Device counts.
    //
    i32Idx = FindCGIParameter("din", pcParam, i32NumParams);
    if(i32Idx != -1)
    {
        ConfigSetDinDevices((uint8_t)ustrtoul(pcValue[i32Idx], 0, 10));
    }
    i32Idx = FindCGIParameter("relay", pcParam, i32NumParams);
    if(i32Idx != -1)
    {
        ConfigSetRelayDevices((uint8_t)ustrtoul(pcValue[i32Idx], 0, 10));
    }

    //
    // Per-input type bitmask ("types" = hex string, 2 chars per byte of 8
    // inputs; bit n of byte b = input b*8+n is pushbutton when set).
    //
    i32Idx = FindCGIParameter("types", pcParam, i32NumParams);
    if(i32Idx != -1)
    {
        const char *pcT = pcValue[i32Idx];
        int iByte = 0;
        while((pcT[0] != '\0') && (pcT[1] != '\0') && (iByte < 15))
        {
            uint8_t ui8Val = (uint8_t)((HexNibble(pcT[0]) << 4) |
                                       HexNibble(pcT[1]));
            int iBit;
            for(iBit = 0; iBit < 8; iBit++)
            {
                ConfigSetInputPushbutton(iByte * 8 + iBit,
                                        (ui8Val & (1u << iBit)) != 0);
            }
            pcT += 2;
            iByte++;
        }
    }

    //
    // Per-input binding table: "binds" = 3 hex chars per slot, 4 slots per
    // input, for min(D*8, 16) inputs.  12-bit encoding: output[6:0]|act[4:3]|trig[2:0].
    // "000" = unused slot.
    //
    i32Idx = FindCGIParameter("binds", pcParam, i32NumParams);
    if(i32Idx != -1)
    {
        const char *pcB = pcValue[i32Idx];
        int iLen = (int)strlen(pcB);
        int iMaxIn = (int)ConfigGetDinDevices() * 8;
        int iInput, iSlot, iPos = 0;
        if(iMaxIn > 16) { iMaxIn = 16; }
        for(iInput = 0; (iInput < iMaxIn) && ((iPos + 2) < iLen); iInput++)
        {
            for(iSlot = 0; (iSlot < CFG_BIND_SLOTS) &&
                           ((iPos + 2) < iLen); iSlot++, iPos += 3)
            {
                uint16_t ui16V = (uint16_t)(((uint16_t)HexNibble(pcB[iPos]) << 8) |
                                            ((uint16_t)HexNibble(pcB[iPos+1]) << 4) |
                                             (uint16_t)HexNibble(pcB[iPos+2]));
                uint8_t ui8TrigAct = (uint8_t)(ui16V & 0x1Fu);
                uint8_t ui8Out     = (uint8_t)((ui16V >> 5) & 0x7Fu);
                if((ui8TrigAct & 0x07u) == 0)
                {
                    ui8TrigAct = 0;
                    ui8Out = BIND_OUTPUT_NONE;
                }
                ConfigBindingSet(iInput, iSlot, ui8TrigAct, ui8Out);
            }
        }
    }

    //
    // Persist all three records and request chain + discovery update.
    //
    ConfigSave();
    ConfigIOSave();
    ConfigBindingSave();
    g_bStartMQTT = true;
    g_bRepublishMQTT = true;

    return(IOCFG_CGI_RESPONSE);
}

//*****************************************************************************
//
// This function is called by the HTTP server whenever it encounters an SSI
// tag in a web page.  The iIndex parameter provides the index of the tag in
// the g_pcConfigSSITags array. This function writes the substitution text
// into the pcInsert array, writing no more than iInsertLen characters.
//
//*****************************************************************************
//*****************************************************************************
//
// FwChunkCGIHandler - Receives one hex-encoded binary chunk of an OTA image.
//
// URL format (GET):
//   /fwchunk.cgi?seq=N&last=0&data=HEXHEX...
//
// seq=0 initialises the upload and erases the header page + first image page.
// Each subsequent request appends to the staging flash.
// last=1 flushes the alignment buffer, computes CRC32, writes the OTA header
// and EEPROM flag, then schedules a system reset.
//
// The hex-encoded payload carries up to ~494 binary bytes per request
// (limited by LWIP_HTTPD_MAX_URI_LEN = 1024).
//
//*****************************************************************************
static char *
FwChunkCGIHandler(int32_t iIndex, int32_t i32NumParams,
                  char *pcParam[], char *pcValue[])
{
    int32_t  iSeqIdx, iLastIdx, iDataIdx;
    int32_t  iSeqNum;
    bool     bLast;
    const char *pcData;
    uint32_t ui32DataHexLen, i;
    uint32_t ui32PageAddr;
    tOTAHeader sHdr;
    uint32_t ui32Crc;

    iSeqIdx  = FindCGIParameter("seq",  pcParam, i32NumParams);
    iLastIdx = FindCGIParameter("last", pcParam, i32NumParams);
    iDataIdx = FindCGIParameter("data", pcParam, i32NumParams);

