samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
    if(iSeqIdx < 0 || iDataIdx < 0)
    {
        return(DEFAULT_CGI_RESPONSE);
    }

    iSeqNum = (int32_t)ustrtoul(pcValue[iSeqIdx], NULL, 10);
    bLast   = (iLastIdx >= 0) && (pcValue[iLastIdx][0] == '1');
    pcData  = pcValue[iDataIdx];
    ui32DataHexLen = ustrlen(pcData) & ~1u; // must be even (pairs of hex chars)

    //
    // First chunk: reset state and pre-erase the header and first image page.
    //
    if(iSeqNum == 0)
    {
        g_ui32OTAWriteAddr    = OTA_IMAGE_ADDR;
        g_ui32OTASize         = 0;
        g_ui32OTAAlignLen     = 0;
        g_ui32OTALastErasedPage = OTA_IMAGE_ADDR;

        MAP_FlashErase(OTA_HEADER_ADDR);
        MAP_FlashErase(OTA_IMAGE_ADDR);

        UARTprintf("OTA: upload started.\n");
    }

    //
    // Decode hex bytes and write to staging flash in 4-byte aligned words.
    //
    for(i = 0; i < ui32DataHexLen; i += 2)
    {
        g_ui8OTAAlignBuf[g_ui32OTAAlignLen++] =
            (uint8_t)((HexNibble(pcData[i]) << 4) | HexNibble(pcData[i + 1]));
        g_ui32OTASize++;

        if(g_ui32OTAAlignLen == 4)
        {
            //
            // Erase the next 16 KB page when the write pointer first enters it.
            //
            ui32PageAddr = g_ui32OTAWriteAddr & ~(0x4000u - 1u);
            if(ui32PageAddr > g_ui32OTALastErasedPage)
            {
                MAP_FlashErase(ui32PageAddr);
                g_ui32OTALastErasedPage = ui32PageAddr;
            }

            MAP_FlashProgram((uint32_t *)(uintptr_t)g_ui8OTAAlignBuf,
                             g_ui32OTAWriteAddr, 4);
            g_ui32OTAWriteAddr += 4;
            g_ui32OTAAlignLen   = 0;
        }
    }

    //
    // Last chunk: flush any partial word (pad with 0xFF), then finalise.
    //
    if(bLast)
    {
        if(g_ui32OTAAlignLen > 0)
        {
            while(g_ui32OTAAlignLen < 4)
            {
                g_ui8OTAAlignBuf[g_ui32OTAAlignLen++] = 0xFF;
            }
            MAP_FlashProgram((uint32_t *)(uintptr_t)g_ui8OTAAlignBuf,
                             g_ui32OTAWriteAddr, 4);
            g_ui32OTAWriteAddr += 4;
            g_ui32OTAAlignLen   = 0;
        }

        //
        // CRC32 the staged image and write the header to 0x80000.
        //
        ui32Crc = ConfigCRC32((const uint8_t *)OTA_IMAGE_ADDR, g_ui32OTASize);

        sHdr.ui32Magic = OTA_HDR_MAGIC;
        sHdr.ui32Size  = g_ui32OTASize;
        sHdr.ui32CRC32 = ui32Crc;
        sHdr.ui32Rsvd  = 0;
        MAP_FlashProgram((uint32_t *)(uintptr_t)&sHdr,
                         OTA_HEADER_ADDR, sizeof(tOTAHeader));

        //
        // Set EEPROM pending flag so the next boot applies the update.
        //
        OtaSetPending(g_ui32OTASize);

        UARTprintf("OTA: %u bytes, CRC=0x%08x. Rebooting...\n",
                   g_ui32OTASize, ui32Crc);

        //
        // Signal the main loop to reset after the HTTP response is sent.
        //
        g_bOTAReset = true;
        return("/fwupdate_ok.shtml");
    }

    return("/fwupdate.shtml");
}

//*****************************************************************************
//
// FactoryResetCGIHandler - Web-triggered factory reset.
//
// Invalidates all EEPROM records, then schedules a system reset via the same
// g_bOTAReset flag used by the OTA handler so the HTTP response is sent first.
//
//*****************************************************************************
static char *
FactoryResetCGIHandler(int32_t iIndex, int32_t i32NumParams,
                       char *pcParam[], char *pcValue[])
{
    UARTprintf("Factory reset triggered via web UI.\n");
    MQTTAppStop();
    ConfigFactoryReset();
    g_bOTAReset = true;
    return("/factoryreset_ok.shtml");
}

//*****************************************************************************
//
// CheckHWFactoryReset - Check SW1 (PJ0) at startup.
//
// If SW1 is held continuously for 5 seconds, all EEPROM records are
// invalidated and the device resets.  LED D1 (PN1) blinks as a countdown
// indicator.  Releasing SW1 at any point cancels the operation.
//
// Call after ConfigInit() (EEPROM must be initialised) but before the
// network stack starts.
//
//*****************************************************************************
static void
CheckHWFactoryReset(void)
{
    uint32_t ui32Count;

    //
    // Enable the GPIO ports used by SW1 (Port J) and LED D1 (Port N).
    // PinoutSet() may already have done this, but enabling twice is harmless.
    //
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOJ);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPION);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOJ) ||
          !MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPION))
    {
    }

    //
    // PJ0 input with weak pull-up (SW1 is active-low).
    //
    MAP_GPIODirModeSet(GPIO_PORTJ_BASE, GPIO_PIN_0, GPIO_DIR_MODE_IN);
    MAP_GPIOPadConfigSet(GPIO_PORTJ_BASE, GPIO_PIN_0,
                         GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD_WPU);

    //
    // PN1 output for LED D1 (active-high, off initially).
    //
    MAP_GPIODirModeSet(GPIO_PORTN_BASE, GPIO_PIN_1, GPIO_DIR_MODE_OUT);
    MAP_GPIOPadConfigSet(GPIO_PORTN_BASE, GPIO_PIN_1,
                         GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD);
    MAP_GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1, 0);

    //
    // Quick exit if SW1 is not held at boot.
    //
    if(MAP_GPIOPinRead(GPIO_PORTJ_BASE, GPIO_PIN_0) != 0)
    {
        return;
    }

    UARTprintf("HW factory reset: keep SW1 held for 5s to confirm...\n");

    //
    // 500 x 10ms = 5 000ms countdown.  LED blinks every 500ms.
    //
    for(ui32Count = 0; ui32Count < 500; ui32Count++)
    {
        //
        // Toggle LED every 50 iterations (~500ms period).
        //
        MAP_GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1,
                         ((ui32Count / 50) & 1) ? GPIO_PIN_1 : 0);

        MAP_SysCtlDelay(g_ui32SysClock / 300);   // ~10 ms at 120 MHz

        if(MAP_GPIOPinRead(GPIO_PORTJ_BASE, GPIO_PIN_0) != 0)
        {
            MAP_GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1, 0);
            UARTprintf("HW factory reset: cancelled (SW1 released).\n");
            return;
        }
    }

    //
    // SW1 held for 5 seconds — perform factory reset.
    //
    MAP_GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1, GPIO_PIN_1); // LED on solid
    UARTprintf("HW factory reset: erasing EEPROM...\n");
    MQTTAppStop();
    ConfigFactoryReset();
    UARTprintf("HW factory reset: rebooting...\n");
    MAP_SysCtlDelay(g_ui32SysClock / 3);
    MAP_SysCtlReset();
}

//*****************************************************************************
static int32_t
SSIHandler(int32_t iIndex, char *pcInsert, int32_t iInsertLen)
{
    tMQTTConfig *psCfg = ConfigGet();

    //
    // Which SSI tag have we been passed?  (The password is intentionally never
    // echoed back to the browser.)
    //
    switch(iIndex)
    {
        case SSI_INDEX_HOST:
            usnprintf(pcInsert, iInsertLen, "%s", psCfg->pcHost);
            break;

        case SSI_INDEX_PORT:
            usnprintf(pcInsert, iInsertLen, "%d", psCfg->ui16Port);
            break;

        case SSI_INDEX_CLIENT:
            usnprintf(pcInsert, iInsertLen, "%s", psCfg->pcClientID);
            break;

        case SSI_INDEX_USER:
            usnprintf(pcInsert, iInsertLen, "%s", psCfg->pcUser);
            break;

        case SSI_INDEX_TOPIC:
            usnprintf(pcInsert, iInsertLen, "%s", psCfg->pcTopicBase);
            break;

        case SSI_INDEX_DIN:
            usnprintf(pcInsert, iInsertLen, "%d", ConfigGetDinDevices());
            break;

        case SSI_INDEX_RELAY:
            usnprintf(pcInsert, iInsertLen, "%d", ConfigGetRelayDevices());
            break;

        case SSI_INDEX_AUTH:
            usnprintf(pcInsert, iInsertLen, "%s",
                      psCfg->ui8UseAuth ? "checked" : "");
            break;

