samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
        case SSI_INDEX_STATUS:
            usnprintf(pcInsert, iInsertLen, "%s", MQTTAppStatusStr());
            break;

        case SSI_INDEX_IP:
            usnprintf(pcInsert, iInsertLen, "%d.%d.%d.%d",
                      g_ui32IPAddress & 0xff, (g_ui32IPAddress >> 8) & 0xff,
                      (g_ui32IPAddress >> 16) & 0xff,
                      (g_ui32IPAddress >> 24) & 0xff);
            break;

        case SSI_INDEX_IOTYPES:
        {
            //
            // Emit one byte (2 hex chars) per DIN device, LSB = input 0 of
            // that device.  The I/O config page uses this to seed each select.
            //
            static const char pcHex[] = "0123456789abcdef";
            int iDin = (int)ConfigGetDinDevices();
            int iByte, iBit;
            int iPos = 0;
            for(iByte = 0; (iByte < iDin) && ((iPos + 2) < iInsertLen);
                iByte++)
            {
                uint8_t ui8Val = 0;
                for(iBit = 0; iBit < 8; iBit++)
                {
                    if(ConfigInputIsPushbutton(iByte * 8 + iBit))
                    {
                        ui8Val |= (uint8_t)(1u << iBit);
                    }
                }
                pcInsert[iPos++] = pcHex[(ui8Val >> 4) & 0xF];
                pcInsert[iPos++] = pcHex[ui8Val & 0xF];
            }
            pcInsert[iPos] = '\0';
            break;
        }

        case SSI_INDEX_IOBINDS:
        {
            //
            // Emit min(D*8, 16) inputs x 4 slots x 3 hex chars = up to 192 chars.
            // Per slot: 12-bit value = (output<<5)|(action<<3)|trigger as "XYZ".
            // "000" = unused slot.
            //
            static const char pcHexB[] = "0123456789abcdef";
            int iDin = (int)ConfigGetDinDevices();
            int iMaxIn = iDin * 8;
            int iInput, iSlot, iPos = 0;
            if(iMaxIn > 16) { iMaxIn = 16; }
            for(iInput = 0; (iInput < iMaxIn) && ((iPos + 3) < iInsertLen);
                iInput++)
            {
                for(iSlot = 0; (iSlot < CFG_BIND_SLOTS) &&
                               ((iPos + 3) < iInsertLen); iSlot++)
                {
                    uint8_t ta  = ConfigBindingGetTrigAct(iInput, iSlot);
                    uint8_t out = ConfigBindingGetOutput(iInput, iSlot);
                    uint16_t v  = 0;
                    if(((ta & 0x07u) != 0) && (out != BIND_OUTPUT_NONE))
                    {
                        v = (uint16_t)(((uint16_t)out << 5) | (ta & 0x1Fu));
                    }
                    pcInsert[iPos++] = pcHexB[(v >> 8) & 0xFu];
                    pcInsert[iPos++] = pcHexB[(v >> 4) & 0xFu];
                    pcInsert[iPos++] = pcHexB[v & 0xFu];
                }
            }
            pcInsert[iPos] = '\0';
            break;
        }

        case SSI_INDEX_FWVER:
        {
            //
            // Build timestamp formatted as YYYYMMDDHHMM from __DATE__ and
            // __TIME__ (both are compile-time string literals).
            //
            // __DATE__ = "Mon DD YYYY"  e.g. "Jul 11 2026"  (space-padded day)
            // __TIME__ = "HH:MM:SS"     e.g. "09:23:45"
            //
            static const char pcMons[] =
                "JanFebMarAprMayJunJulAugSepOctNovDec";
            const char *pd = __DATE__;
            const char *pt = __TIME__;
            int iMon, iDay, iYear, iHour, iMin;

            for(iMon = 0; iMon < 12; iMon++)
            {
                if((pd[0] == pcMons[iMon * 3]) &&
                   (pd[1] == pcMons[iMon * 3 + 1]) &&
                   (pd[2] == pcMons[iMon * 3 + 2]))
                {
                    break;
                }
            }
            iMon++;
            iDay  = ((pd[4] == ' ') ? 0 : (pd[4] - '0')) * 10 + (pd[5] - '0');
            iYear = (pd[7]-'0')*1000 + (pd[8]-'0')*100 +
                    (pd[9]-'0')*10   + (pd[10]-'0');
            iHour = (pt[0]-'0')*10 + (pt[1]-'0');
            iMin  = (pt[3]-'0')*10 + (pt[4]-'0');

            usnprintf(pcInsert, iInsertLen, "%04d%02d%02d%02d%02d",
                      iYear, iMon, iDay, iHour, iMin);
            break;
        }

        default:
            usnprintf(pcInsert, iInsertLen, "??");
            break;
    }

    //
    // Tell the server how many characters our insert string contains.
    //
    return(strlen(pcInsert));
}

//*****************************************************************************
//
// The interrupt handler for the SysTick interrupt.
//
//*****************************************************************************
void
SysTickIntHandler(void)
{
    //
    // Call the lwIP timer handler.
    //
    lwIPTimer(SYSTICKMS);

    //
    // Flag a periodic application tick for the main loop (MQTT keep-alive /
    // reconnect service).
    //
    g_bSysTickFlag = true;
}

//*****************************************************************************
//
// The interrupt handler for the timer used to pace the animation.
//
//*****************************************************************************
void
AnimTimerIntHandler(void)
{
    //
    // Clear the timer interrupt.
    //
    MAP_TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);

    //
    // Indicate that a timer interrupt has occurred.
    //
    HWREGBITW(&g_ulFlags, FLAG_TICK) = 1;
}

//*****************************************************************************
//
// Display an lwIP type IP Address.
//
//*****************************************************************************
void
DisplayIPAddress(uint32_t ui32Addr)
{
    char pcBuf[16];

    //
    // Convert the IP Address into a string.
    //
    usprintf(pcBuf, "%d.%d.%d.%d", ui32Addr & 0xff, (ui32Addr >> 8) & 0xff,
            (ui32Addr >> 16) & 0xff, (ui32Addr >> 24) & 0xff);

    //
    // Display the string.
    //
    UARTprintf(pcBuf);
}

//*****************************************************************************
//
// Required by lwIP library to support any host-related timer functions.
//
//*****************************************************************************
void
lwIPHostTimerHandler(void)
{
    uint32_t ui32NewIPAddress;

    //
    // Get the current IP address.
    //
    ui32NewIPAddress = lwIPLocalIPAddrGet();

    //
    // See if the IP address has changed.
    //
    if(ui32NewIPAddress != g_ui32IPAddress)
    {
        //
        // See if there is an IP address assigned.
        //
        if(ui32NewIPAddress == 0xffffffff)
        {
            //
            // Indicate that there is no link.
            //
            UARTprintf("Waiting for link.\n");
        }
        else if(ui32NewIPAddress == 0)
        {
            //
            // There is no IP address, so indicate that the DHCP process is
            // running.
            //
            UARTprintf("Waiting for IP address.\n");
        }
        else
        {
            //
            // Display the new IP address.
            //
            UARTprintf("IP Address: ");
            DisplayIPAddress(ui32NewIPAddress);
            UARTprintf("\n");
            UARTprintf("Open a browser and enter the IP address.\n");

            //
            // We now have network connectivity: ask the main loop to bring up
            // the MQTT connection (if a broker has been configured).
            //
            g_bStartMQTT = true;
        }

        //
        // Save the new IP address.
        //
        g_ui32IPAddress = ui32NewIPAddress;
    }

    //
    // If there is not an IP address.
    //
    if((ui32NewIPAddress == 0) || (ui32NewIPAddress == 0xffffffff))
    {
        //
        // Do nothing and keep waiting.
        //
    }
}

//*****************************************************************************
//
// Apply all binding slots for one input that match the given trigger event.
// Each matching slot sets a relay and publishes its new retained state.
//
//*****************************************************************************
static void
ApplyBindings(int iInput, uint8_t ui8Trig)
{
    int iSlot;

